===
[Comment] line comment
===

-- a comment

---

(unison
  (comment))

===
[Comment] multiline comment
===
{-
    this is a multiline comment
-}
---

(unison
  (comment))

===
[Comment] fold
===

---
x = 5

---

(unison
  (fold))

===
[Comment] nested multiline comment
===
x = 5 {- this is a
    multiline {-
comment with -} nesting
-}
---

(unison
  (term_declaration
    (term_definition
      (regular_identifier)
      (kw_equals)
      (block_term
        (nat))
      (comment))))

===
[Comment] before type signature
===
-- Bytes literal
someBytes : Bytes
someBytes = 0xsdeadbeef
---

(unison
  (comment)
  (term_declaration
    (type_signature
      (regular_identifier)
      (type_signature_colon)
      (term_type
        (regular_identifier)))
    (term_definition
      (regular_identifier)
      (kw_equals)
      (block_term
        (literal_byte)))))
