===
infix op
===
y = 5 + 2
---
(unison
    (term_declaration
        (term_definition
            (regular_identifier)
            (kw_equals)
            (function_application
                (nat)
                (operator)
                (nat)))))
===
prefix op
===
y = (+) 5 2
---
(unison
    (term_declaration
        (term_definition
            (regular_identifier)
            (kw_equals)
            (function_application
                (operator)
                (nat)
                (nat)))))
===
regular function
===
x = myFunc 1 2
---
(unison
    (term_declaration
        (term_definition
            (regular_identifier)
            (kw_equals)
            (function_application
                (regular_identifier)
                (nat)
                (nat)))))
===
infix operator function
===
x = 1 <<- 2
---
(unison
    (term_declaration
        (term_definition
            (regular_identifier)
            (kw_equals)
            (function_application
                (nat)
                (operator)
                (nat)))))
