===
[Handlers] one line
===
a = handle x with foo
---

(unison
  (term_declaration
    (term_definition
      (regular_identifier)
      (kw_equals)
      (block_term
        (handler
          (handle)
          (block_term
            (regular_identifier))
          (with)
          (block_term
            (regular_identifier)))))))

===
[Handlers] multiline 1
===
a = handle
      x = 23 + 42
      x + foo 8 102.0 +4
    with foo
---

(unison
  (term_declaration
    (term_definition
      (regular_identifier)
      (kw_equals)
      (block_term
        (handler
          (handle)
          (term_declaration
            (term_definition
              (regular_identifier)
              (kw_equals)
              (block_term
                (nat)
                (operator)
                (nat))))
          (block_term
            (regular_identifier)
            (operator)
            (regular_identifier)
            (nat)
            (float)
            (int))
          (with)
          (block_term
            (regular_identifier)))))))

===
[Handlers] multiline 2
===
a = handle
      x = 1
      x
    with foo
---

(unison
  (term_declaration
    (term_definition
      (regular_identifier)
      (kw_equals)
      (block_term
        (handler
          (handle)
          (term_declaration
            (term_definition
              (regular_identifier)
              (kw_equals)
              (block_term
                (nat))))
          (block_term
            (regular_identifier))
          (with)
          (block_term
            (regular_identifier)))))))

===
[Handlers] with cases
===
a = handle foo with cases
     { x } -> x
---

(unison
  (term_declaration
    (term_definition
      (regular_identifier)
      (kw_equals)
      (block_term
        (handler
          (handle)
          (block_term
            (regular_identifier))
          (with)
          (block_term
            (match_expression_lambda
              (cases)
              (pattern_case
                (pattern
                  (effect_pattern
                    (effect_pure
                      (pattern
                        (var_or_nullary_ctor
                          (regular_identifier))))))
                (arrow_symbol)
                (block_term
                  (regular_identifier))))))))))
