===
[Handlers] one line
===
a = handle x with foo
---
(unison (term_declaration (term_definition (wordy_id) (kw_equals) (handler (handle) (regular_identifier) (with) (regular_identifier)))))
===
[Handlers] multiline 1
===
a = handle
      x = 23 + 42
      x + foo 8 102.0 +4
    with foo
---
(unison
      (term_declaration (term_definition (wordy_id) (kw_equals)
            (handler (handle)
                  (term_declaration (term_definition (wordy_id) (kw_equals) (function_application (nat) (operator) (nat))))
                  (function_application (regular_identifier) (operator) (function_application (wordy_id) (nat) (float) (int)))
            (with) (regular_identifier)))))
===
[Handlers] multiline 2
===
a = handle
      x = 1
      x
    with foo
---
(unison
      (term_declaration (term_definition (wordy_id) (kw_equals)
            (handler (handle)
                  (term_declaration (term_definition (wordy_id) (kw_equals) (nat)))
                  (regular_identifier)
            (with) (regular_identifier)))))
===
[Handlers] with cases
===
a = handle foo with cases
     { x } -> x
---
(unison
      (term_declaration
            (term_definition
                  (wordy_id)
                  (kw_equals)
                  (handler
                        (handle)
                        (regular_identifier)
                        (with)
                        (cases)
                        (pattern (ability_pattern (constructor_or_variable_pattern (regular_identifier))) (arrow_symbol) (regular_identifier))))))
