===
[misc] Watch expression
===
> square 4
---
(unison
    (watch_expression
        (function_application
            (regular_identifier)
            (nat))))
===
[misc] Test watch expression
===
foo> 5
---
(unison (test_watch_expression (regular_identifier) (nat)))
