===
[misc] namespace pragma
===
namespace mynamespace
x = 5
---
(unison
    (namespace_pragma (kw_namespace) (namespace (regular_identifier)))
    (term_declaration
        (term_definition
            (regular_identifier)
            (kw_equals)
            (nat))))
===
[misc] namespace pragma mid-file
===
x = 5
namespace My.Namespace
sum x y = x + y
> sum x 2
---
(unison
    (term_declaration
        (term_definition
            (regular_identifier)
            (kw_equals)
            (nat)))
    (namespace_pragma (kw_namespace) (namespace (path) (regular_identifier)))
    (term_declaration
        (term_definition
            (regular_identifier)
            (regular_identifier)
            (regular_identifier)
            (kw_equals)
            (regular_identifier)
            (operator)
            (regular_identifier)))
    (watch_expression
        (regular_identifier)
        (regular_identifier)
        (nat)))
===
[misc] Watch expression
===
> square 4
---
(unison
    (watch_expression
        (regular_identifier)
        (nat)))
===
[misc] Test watch expression
===
test> 5
---
(unison (test_watch_expression (nat)))
===
[misc] test.io watch expression
===
test.io> 5
---
(unison (test_watch_expression (nat)))
===
[Misc] force
===
> x()
---
(unison
    (watch_expression
        (force
            (regular_identifier)
            (unit))))
