===
infix op functional expression not parsed as such
===
x = 1 + 2
---

(unison
  (term_declaration
    (term_definition
      (regular_identifier)
      (kw_equals)
      (nat)
      (operator)
      (nat))))

===
[Regression] Issue 21: built-in hash without path not parsed correctly
===
x = ##Foo
---

(unison
  (term_declaration
    (term_definition
      (regular_identifier)
      (kw_equals)
      (built_in_hash))))

===
[Regression] issue 24: multiline text literal with an unescaped double quotation mark
===
> """ foo " bar """
---

(unison
  (watch_expression
    (literal_text)))

===
[Regression] Issue 30, infix ops with path in function application
===
> 1 Nat.+ 2
---

(unison
  (watch_expression
    (nat)
    (path)
    (operator)
    (nat)))

===
[Regression] #34 - watch expressions can be binds (term definitions, but types are not allowed as per TermParser.hs, so not term declarations)
They cannot be destructuring binds, which cannot happen at the top level. Verified via Unison LSP.
===
> z = 5
---

(unison
  (watch_expression
    (term_declaration
      (term_definition
        (regular_identifier)
        (kw_equals)
        (nat)))))

===
[Regression] Issue 37, docblock can be anywhere an expression is
===
z = {{ test }}
---

(unison
  (term_declaration
    (term_definition
      (regular_identifier)
      (kw_equals)
      (doc_block))))

===
[Regression] Issue 37, anonymous docblock immediately precedes term declaration
===
{{ howdy }}
x = 5
---

(unison
  (term_declaration
    (doc_block)
    (term_definition
      (regular_identifier)
      (kw_equals)
      (nat))))

===
[Regression] Issue 39, Parenthesized operators in term declaration (def'n + type sig) fail
===
(Numeric.>=) : Numeric -> Numeric -> Boolean
(Numeric.>=) = todo "implement"
---

(unison
  (term_declaration
    (type_signature
      (open_parens)
      (path)
      (operator)
      (close_parens)
      (type_signature_colon)
      (term_type
        (regular_identifier)
        (arrow_symbol)
        (regular_identifier)
        (arrow_symbol)
        (regular_identifier)))
    (term_definition
      (open_parens)
      (path)
      (operator)
      (close_parens)
      (kw_equals)
      (regular_identifier)
      (literal_text))))

===
[Regression] Issue 46, comment that appears where a fold could be fails
===
-- this is a comment
---

(unison
  (comment))

===
[Regression] #82
===
-- builtin lib.base.Float.fromNat : lib.base.Nat -> lib.base.Float

lib.base.Float.fromNat.doc : Doc
lib.base.Float.fromNat.doc =
  use Float fromNat
  {{
  Convert a {type Nat} to a {type Float}.

  # Examples

    ```
    fromNat 3
    ```

    ```
    fromNat maxNat
    ```
  }}
---

(unison
  (comment)
  (term_declaration
    (type_signature
      (path)
      (regular_identifier)
      (type_signature_colon)
      (term_type
        (regular_identifier)))
    (term_definition
      (path)
      (regular_identifier)
      (kw_equals)
      (use_clause
        (use)
        (namespace
          (regular_identifier))
        (regular_identifier))
      (doc_block))))

===
[Regression] 84 path with symboly id fails
===
lib.base.Nat.!=.doc = 5
---

(unison
  (term_declaration
    (term_definition
      (path)
      (regular_identifier)
      (kw_equals)
      (nat))))

===
[Regression] pattern matching guards should be part of a layouted block
===
> match true with
      a
        | true  ->
            1
        | otherwise -> 5
---

(unison
  (watch_expression
    (match)
    (literal_boolean)
    (with)
    (pattern
      (var_or_as
        (regular_identifier))
      (guarded_block
        (pipe)
        (guard
          (literal_boolean))
        (arrow_symbol)
        (nat))
      (guarded_block
        (pipe)
        (guard
          (otherwise))
        (arrow_symbol)
        (nat)))))

===
[Regression] #91 - infix op can have namespace prefix
===
a lib.base.Nat.!= b =
  use Nat ==
  Boolean.not (a == b)
---

(unison
  (term_declaration
    (term_definition
      (regular_identifier)
      (path)
      (operator)
      (regular_identifier)
      (kw_equals)
      (use_clause
        (use)
        (namespace
          (regular_identifier))
        (operator))
      (path)
      (regular_identifier)
      (tuple_or_parenthesized
        (regular_identifier)
        (operator)
        (regular_identifier)))))

===
[Regression] watch doc block fails to parse
===
> {{}}
---

(unison
  (watch_expression
    (doc_block)))

===
[Regression] #103, match scrutinee should be term
===
> match foo hit with
      _   -> a
---

(unison
  (watch_expression
    (match)
    (regular_identifier)
    (regular_identifier)
    (with)
    (pattern
      (blank_pattern)
      (arrow_symbol)
      (regular_identifier))))

===
[Regression] fold that is more than just ---
===
----This starts a fold
this should still be fold
---

(unison
  (fold))

===
[Regression] <| operator
===
> a <| b
---

(unison
  (watch_expression
    (regular_identifier)
    (operator)
    (regular_identifier)))

===
[Regression] 2-symbol op ending with &
===
> a <& b
---

(unison
  (watch_expression
    (regular_identifier)
    (operator)
    (regular_identifier)))

===
[Regression] Issue 121: pattern following effect pattern fails to be recognized as a pattern
===
a = cases
    { a } -> 2
    a -> 2
---

(unison
  (term_declaration
    (term_definition
      (regular_identifier)
      (kw_equals)
      (cases)
      (pattern
        (effect_pattern
          (effect_pure
            (var_or_as
              (regular_identifier))))
        (arrow_symbol)
        (nat))
      (pattern
        (var_or_as
          (regular_identifier))
        (arrow_symbol)
        (nat)))))

===
[Regression] #134 multi-line quotation mark text literal that opens with more than three " needs balanced ending
===
x = """"
foo
bar"""
baz""""
---

(unison
  (term_declaration
    (term_definition
      (regular_identifier)
      (kw_equals)
      (literal_text))))

===
[Regression] GH-139: underscores in path names
===
lib.unison_base_3_0_0.Nat.gcd = 5
---

(unison
  (term_declaration
    (term_definition
      (path)
      (regular_identifier)
      (kw_equals)
      (nat))))

===
[Regression] 141 - use clause in block
===
complexCalculation input =
  let
    result = 5
    use Nat + - *
    result
---

(unison
  (term_declaration
    (term_definition
      (regular_identifier)
      (regular_identifier)
      (kw_equals)
      (exp_let
        (kw_let)
        (term_declaration
          (term_definition
            (regular_identifier)
            (kw_equals)
            (nat)))
        (use_clause
          (use)
          (namespace
            (regular_identifier))
          (operator)
          (operator)
          (operator))
        (regular_identifier)))))

===
[Regression] 141 - use clause in former layout block
===
x =
  (a, b) =
    n = 5
    use c d e
    (1, 2)
  a
---

(unison
  (term_declaration
    (term_definition
      (regular_identifier)
      (kw_equals)
      (destructuring_bind
        (parenthesized_or_tuple_pattern
          (open_parens)
          (var_or_as
            (regular_identifier))
          (comma)
          (var_or_as
            (regular_identifier))
          (close_parens))
        (kw_equals)
        (term_declaration
          (term_definition
            (regular_identifier)
            (kw_equals)
            (nat)))
        (use_clause
          (use)
          (namespace
            (regular_identifier))
          (regular_identifier)
          (regular_identifier))
        (tuple_or_parenthesized
          (nat)
          (nat)))
      (regular_identifier))))

===
[Regression] GH-143 - tuple expr in case branch return
===
swap = cases
  (x, y) -> (y, x)
---

(unison
  (term_declaration
    (term_definition
      (regular_identifier)
      (kw_equals)
      (cases)
      (pattern
        (parenthesized_or_tuple_pattern
          (open_parens)
          (var_or_as
            (regular_identifier))
          (comma)
          (var_or_as
            (regular_identifier))
          (close_parens))
        (arrow_symbol)
        (tuple_or_parenthesized
          (regular_identifier)
          (regular_identifier))))))

===
[Regression] GH-142 - destructuring bind issue
===
y =
  (x, _) = someFunction()
  x
---

(unison
  (term_declaration
    (term_definition
      (regular_identifier)
      (kw_equals)
      (destructuring_bind
        (parenthesized_or_tuple_pattern
          (open_parens)
          (var_or_as
            (regular_identifier))
          (comma)
          (blank_pattern)
          (close_parens))
        (kw_equals)
        (force
          (regular_identifier)
          (unit)))
      (regular_identifier))))

===
[Regression] GH-144 Guarded block
===
x = cases
  n
    | otherwise ->
      n2 = getOrUpdate (n - 2) do fibonacci (n - 2)
      a
---

(unison
  (term_declaration
    (term_definition
      (regular_identifier)
      (kw_equals)
      (cases)
      (pattern
        (var_or_as
          (regular_identifier))
        (guarded_block
          (pipe)
          (guard
            (otherwise))
          (arrow_symbol)
          (term_declaration
            (term_definition
              (regular_identifier)
              (kw_equals)
              (regular_identifier)
              (tuple_or_parenthesized
                (regular_identifier)
                (operator)
                (nat))
              (delay_block
                (do)
                (regular_identifier)
                (tuple_or_parenthesized
                  (regular_identifier)
                  (operator)
                  (nat)))))
          (regular_identifier))))))

===
[Regression] destructuring, unexplained cause
===
a =
  unsafeRun! do
    (Arr a) = arr1
    0
---

(unison
  (term_declaration
    (term_definition
      (regular_identifier)
      (kw_equals)
      (regular_identifier)
      (delay_block
        (do)
        (destructuring_bind
          (parenthesized_or_tuple_pattern
            (open_parens)
            (ctor
              (regular_identifier))
            (var_or_as
              (regular_identifier))
            (close_parens))
          (kw_equals)
          (regular_identifier))
        (nat)))))

===
[Regression] GH-145 - 0-ary effect binding pattern
===
a =
  cases
    { b -> c } -> ()
---

(unison
  (term_declaration
    (term_definition
      (regular_identifier)
      (kw_equals)
      (cases)
      (pattern
        (effect_pattern
          (effect_bind
            (var_or_as
              (regular_identifier))
            (effect_arrow)
            (var_or_as
              (regular_identifier))))
        (arrow_symbol)
        (tuple_or_parenthesized)))))

===
[Regression] GH-146 - issue closing layout of do block
===
x = do (a)
---

(unison)

===
[Regression] GH-147 - in-line comments
===
a =
  unsafeRun! -- do
    --(Arr a) --= arr1
    --0
---

(unison
  (term_declaration
    (term_definition
      (regular_identifier)
      (kw_equals)
      (regular_identifier)
      (comment)
      (comment)
      (comment))))
